Repository: 84000/data-translation-memory
Catalog: toh130-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་སྐྱེས་བུ་དམ་པ་འདི་གཉིས་དེ་བཞིན་གཤེགས་པ་གང་ལས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་ཇི་སྲིད་ཅིག་ལགས། །
en: “Blessed One, from which thus-gone one did these two holy beings develop the mind set on unsurpassed and completely perfect awakening?

source: དེའི་མཚན་ནི་ཅི་ཞེས་བགྱི། །
en: And how long ago was that?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ལེགས་པར་བསྟན་དུ་གསོལ།
en: What was his name? Blessed One, thus-gone, worthy, completely perfect Buddha, please tell us!”

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ཀྱང་དེའི་བྱ་བ་དང་། དེའི་སྤྱོད་པ་དང་། དེའི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་ཏེ།
en: “It is thus that other bodhisattvas, too, should perfect their conduct, actions, and aspirations.

source: དེ་ལྟ་བས་ན་པད་མའི་དཔལ་གྱི་སྙིང་པོ་ཁྱོད་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: Therefore, Padmaśrīgarbha, listen very well and keep in mind what I will now explain.”

source: བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་དཔལ་གྱི་སྙིང་པོས་བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ།
en: The bodhisattva Padmaśrīgarbha said, “Blessed One, excellent!” and

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: he listened as the Blessed One had advised.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །པད་མའི་དཔལ་གྱི་སྙིང་པོ་
en: “Padmaśrīgarbha,” continued the Blessed One,

source: སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་ཡངས་པ་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་སྟོང་གི་རྡུལ་ཕྲ་རབ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་དུ་ཚད་མེད་པ། དེ་སྙེད་དུ་བསམ་གྱིས་མི་ཁྱབ་པ། རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་ཇི་ཙམ་ཡོད་པ་དེ་བས་ཀྱང་ཆེས་མང་བའི་བསྐལ་པ་བྱུང་བ་དེའི་ཚེ་དེའི་དུས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་ཆེན་བསགས་པ་དཔག་ཏུ་མེད་པ་བདེ་བ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་ན།
en: “previously, in times past, an inconceivable number of eons ago, an endless number of eons ago, at a time stretching further back than any number of eons, a number of eons so great that the number of atoms found in 100,000 worlds—all the limitless and inconceivable number of such atoms—would not equal the number of eons, there was a world called Boundless Accumulation of Precious Qualities and Full Display of Happiness.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: was a blessed, thus-gone, worthy, completely perfect buddha who had perfect knowledge and conduct.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ།
en: He was a blissful one who knew the world,

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ།
en: an unsurpassed charioteer who trained beings,

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: and a teacher of gods and men.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསེར་འོད་སེང་གེའི་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ། །
en: His name was Blessed Buddha King of the Golden-Hued Lion’s Play.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་ཡོན་ཏན་བཀོད་པ་གང་དག་ཡོད་པ་
en: “Padmaśrīgarbha, in the buddha realm of the Blessed One, the thus-gone, worthy, completely perfect Buddha King of the Golden-Hued Lion’s Play, there was a display of precious qualities.

source: དེ་དག་དཔེ་ཅུང་ཟད་ཙམ་གྱིས་ཅུང་ཟད་ཅིག་བརྗོད་པར་བྱ་ཡིས་ཉོན་ཅིག
en: I will only give you a mere illustration of this, just to mention a few of the qualities, so listen.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་མང་ངམ། གསོལ་པ།
en: Padmaśrīgarbha, tell me, are there many displays of precious qualities in the buddha realm of the Blessed One, the thus-gone, worthy, completely perfect Buddha Amitābha?”

source: བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །བསམ་གྱིས་མི་ཁྱབ་པ། ཚད་མ་མཆིས་ཏེ། ངག་གི་ལས་ཀྱིས་ལན་གདབ་པར་སླ་བ་མ་ལགས་སོ།
en: “Blessed One, there are indeed—inconceivably many. They are limitless, and it would not be easy to describe them in words.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། པད་མའི་དཔལ་གྱི་སྙིང་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་
en: The Blessed One said, “Padmaśrīgarbha, consider this analogy.

source: མི་ལ་ལ་ཞིག་གིས་སྐྲའི་རྩེ་མོ་བརྒྱར་གཤགས་པའི་རྩེ་མོས་རྒྱ་མཚོ་ཆེན་པོ་ལས་ཆུ་ཐིགས་པ་གཅིག་བླངས་ན་པད་མའི་དཔལ་གྱི་སྙིང་པོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Imagine a person splits the tip of a hair into one hundred pieces, and then uses the tip of one of those pieces to lift up one drop of water from the ocean.

source: ཆུ་བླངས་པ་དང་། ལྷག་མ་ལུས་པ་དེ་གང་མང་།
en: which would be greater, the amount of water that has been extracted or the water that remains?”

source: བཅོམ་ལྡན་འདས་བླངས་པ་ནི་ཉུང་། ལྷག་མ་ལུས་པ་ནི་ཚད་མ་མཆིས་སོ།
en: “Blessed One, the extracted water would be less. The amount remaining is measureless.”

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་ཁྱོད་མོས་པར་བྱའོ། །ཁྱོད་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Padmaśrīgarbha, think about this and understand it,”

source: མི་དེས་སྐྲའི་རྩེ་མོ་བརྒྱར་གཤགས་པའི་རྩེ་མོ་དེས་རྒྱ་མཚོ་ཆེན་པོ་ལས་ཆུའི་ཐིགས་པ་གཅིག་བླངས་པ་ཇི་སྙེད་པ་དེ་ཙམ་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པར་བལྟའོ། །
en: “The amount of water extracted from the ocean in a single drop by that person using a hundredth of a hair tip represents the displays of precious qualities in the buddha realm of the Blessed One, the thus-gone, worthy, completely perfect Buddha Amitābha,

source: རྒྱ་མཚོ་ཆེན་པོའི་ཆུའི་ཕུང་པོ་ཇི་སྙེད་པ་དེ་ཙམ་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་རིན་ཆེན་བསགས་པ་དཔག་ཏུ་མེད་པ་བདེ་བ་ཀུན་ཏུ་སྟོན་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཡོན་ཏན་བཀོད་པར་བལྟའོ།
en: while the body of water remaining in the ocean represents the displays of precious qualities in Boundless Accumulation of Precious Qualities and Full Display of Happiness, the buddha realm of the Blessed One, the thus-gone, worthy, completely perfect Buddha, King of the Golden-Hued Lion’s Play.

source: དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་དཔག་ཏུ་མེད་དེ། ཇི་ལྟར་ད་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དཔག་ཏུ་མེད་དོ་ཞེས་བྱ་ན།
en: “His saṅgha of hearers was also endless. Right now the Thus-Gone Amitābha’s saṅgha of hearers is said to be boundless,

source: དེ་ལས་བརྒྱ་སྟོང་དུ་བསྒྲེས་པ་བས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཆེས་མང་ངོ་། །
en: but the saṅgha of hearers belonging to the Blessed One, the thus-gone, worthy, completely perfect Buddha, King of the Golden-Hued Lion’s Play, was a hundred thousand times larger than that.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཡང་དེ་སྙེད་དོ། །
en: His saṅgha of bodhisattvas was also of comparable size.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དེ་ནི་ཐེག་པ་གསུམ་ཁོ་ན་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: That blessed, thus-gone one taught the Dharma exclusively within the three vehicles.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་ངས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དང་། །
en: Padmaśrīgarbha, even if I had as many eons as there are grains of sand in the Ganges River to describe the display of precious qualities in the buddha realm of the Blessed One, the thus-gone, worthy, completely perfect Buddha, King of the Golden-Hued Lion’s Play,

source: ཉན་ཐོས་ཀྱི་ཡོན་ཏན་བཀོད་པ་དང་། བདེ་བའི་རྒྱུ་ལས་བརྩམས་ཏེ་ཆོས་བསྟན་པར་འདོད་ཀྱང་།
en: as well as the display of qualities of his hearers and the causes for their happiness,

source: ངའི་སྤོབས་པ་ཡང་ཟད་པར་མི་འགྱུར།
en: I would not run out of things to say,

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དེའི་མཐར་ཕྱིན་པར་ཡང་མི་འགྱུར་རོ། །
en: and I would be unable to complete my description of the display of qualities in that buddha realm.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོ་དེའི་གསུང་རབ་ལ་འཇིག་རྟེན་གྱི་ཁམས་སྟོང་གི་དབང་ཕྱུག་ཆོས་དང་ལྡན་པ་ཆོས་ཀྱི་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་ཅེས་བྱ་བའི་རྒྱལ་པོ་ཞིག་བྱུང་སྟེ།
en: “Padmaśrīgarbha, back then, during the life of the blessed Thus-Gone One, King of the Golden-Hued Lion’s Play, there was a virtuous and religious king who ruled over a thousand worlds. He was known as Glorious Splendor.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་དེ་ལ་བུ་བྱེ་བ་ཕྲག་བརྒྱ་ཡོད་དེ
en: Padmaśrīgarbha, King Glorious Splendor had one billion sons.

source: རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་ཀྱང་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཉི་ཤུ་རྩ་བརྒྱད་དང་ལྡན་པར་གྱུར་ཏོ། །དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏོ། །
en: All the young princes had the twenty-eight marks of a great being, and all of them had genuinely attained unsurpassed and completely perfect awakening.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་ཀྱི་ཡོངས་སུ་ལོངས་སྤྱོད་པའི་སྐྱེད་མོས་ཚལ་ནི་བདུན་ཁྲི་དྲུག་སྟོང་ཡོད་དོ། །རྒྱལ་བུ་རེ་རེ་ལ་ཡང་ལོངས་སྤྱོད་ཀྱི་སྐྱེད་མོས་ཚལ་ཁྲི་ཁྲི་ཡོད་དོ།
en: Padmaśrīgarbha, King Glorious Splendor also had seventy-six thousand pleasure groves for his enjoyment, while each of his sons had ten thousand pleasure groves.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་དཔལ་གྱི་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the bodhisattva Padmaśrīgarbha asked the Blessed One,

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བུད་མེད་མཆིས་སམ། །
en: “Blessed One, were there no women in that buddha realm?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ནི་མེད་དོ། །
en: “No, Padmaśrīgarbha, there were not,” answered the Blessed One.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བུད་མེད་མིང་ཡང་མི་གྲག་སྟེ།
en: “In that buddha realm not even the word ‘woman’ was heard.

source: རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་ཀྱང་ཚངས་པར་སྤྱོད་པ་ལས་གྱུར་པ། །
en: All those young princes had been born out of chastity.

source: བརྫུས་ཏེ་བྱུང་བ་ཤ་སྟག་གོ།
en: They were all born in a miraculous manner.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བསམ་གཏན་གྱི་དགའ་བ་དང་། ཆོས་ཀྱི་དགའ་བའི་ཟས་ཅན་ཡིན་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཁ་ཟས་རགས་པ་མེད་པར་གྱུར་ཏོ།
en: All those beings sustained themselves on the joy of concentration and the joy of the Dharma, and in that buddha realm there was no gross type of food.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་དེ་ནི་ལས་གཞན་མེད་དེ་བུ་དེ་རྣམས་དང་ལྷན་ཅིག་བཅོམ་ལྡན་འདས་དེ་ལ་ལོ་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་བསྙེན་བཀུར་བྱས་སོ།
en: Padmaśrīgarbha, King Glorious Splendor had no formal duties, so together with his sons he worshipped the Blessed One for 840 trillion years.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དེས་དེའི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་ཚད་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་ཚུལ་ལ་མཁས་པ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ། །
en: That Blessed, Thus-Gone One knew the king’s good intentions, so he taught him how to gain expertise in the mode of Dharma known as the boundless seal

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་ཚད་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་ཚུལ་ལ་མཁས་པ་གང་ཞེ་ན།
en: “Padmaśrīgarbha, you may wonder what that ‘expertise in the mode of Dharma known as the boundless seal ’ might be.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྤྱོད་པ་ཚད་མེད་པ་དག་དོན་ཏུ་གཉེར་བར་མི་བྱ་བ་དེ་གང་ཡང་མེད་དོ། །
en: Well, Padmaśrīgarbha, it is that bodhisattva great beings never fail to strive for boundless activities.

source: རྟུལ་བ་ཚད་མེད་པ་གང་དག་བརྩམ་པར་མི་བྱ་བ་དེ་གང་ཡང་མེད་དོ།
en: They never fail to undertake boundless efforts.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱིན་པ་ནི་ཚད་མེད་དོ། །
en: And why? Because those bodhisattvas’ generosity is boundless.

source: ཚུལ་ཁྲིམས་ནི་ཚད་མེད།
en: Their discipline is boundless.

source: བཟོད་པ་ནི་ཚད་མེད།
en: Their patience is boundless.

source: བརྩོན་འགྲུས་ནི་ཚད་མེད།
en: Their diligence is boundless.

source: བསམ་གཏན་ནི་ཚད་མེད།
en: Their concentration is boundless.

source: ཤེས་རབ་ནི་ཚད་མེད།
en: Their knowledge is boundless.

source: འཁོར་བ་ཡོངས་སུ་འཛིན་པ་ནི་ཚད་མེད།
en: Their embrace of saṃsāra is boundless.

source: སེམས་ཅན་དག་ལ་བྱམས་པ་ནི་ཚད་མེད།
en: Their love for beings is boundless.

source: ཞིང་གི་བཀོད་པ་དག་ནི་ཚད་མེད།
en: Their display of realms is boundless.

source: ཉན་ཐོས་དག་ནི་ཚད་མེད།
en: Their hearers are boundless.

source: གཟུགས་ཡོངས་སུ་གྲུབ་པ་དག་ནི་ཚད་མེད།
en: Their perfect forms are boundless.

source: དབྱངས་ནི་ཚད་མེད།
en: Their voices are boundless.

source: སྤོབས་པ་ནི་ཚད་མེད་པའི་ཕྱིར་རོ། །
en: Their eloquence is boundless.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་གིས་དགེ་བའི་རྩ་བ་གང་ཅི་མངོན་པར་འདུ་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཚད་མེད་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོའོ། །
en: “Padmaśrīgarbha, bodhisattvas will dedicate any root of virtue that has been created, even a single instance of the thought of awakening, so that it becomes boundless.

source: ཇི་ལྟར་ཡོངས་སུ་བསྔོས་པས་ཚད་མེད་པར་འགྱུར་ཞེ་ན། །
en: You may wonder how dedication can make it boundless.

source: གང་གི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེའི་ཚེ་སེམས་ཅན་འདི་དག་ཐམས་ཅད་སྐྱེ་བ་མེད་པར་མངོན་སུམ་དུ་བྱེད། །
en: Well, at the time bodhisattvas dedicate that root of merit to all sentient beings, the non-birth of all those sentient beings is actualized,

source: སངས་རྒྱས་ཀྱི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་
en: and it is through their passing into the parinirvāṇa of a buddha that they will pass into parinirvāṇa.

source: འདི་ནི་རིགས་ཀྱི་བུ་ཡོངས་སུ་བསྔོ་བ་ཚད་མེད་པ་ཞེས་བྱའོ།
en: That, son of noble family, is called boundless dedication

source: སྟོང་པ་ཉིད་ཚད་མེད་པའོ། །
en: “Their emptiness is boundless.

source: མཚན་མ་མེད་པ་ཚད་མེད་པའོ། །
en: Their signlessness is boundless.

source: སྨོན་པ་མེད་པ་ཚད་མེད་པའོ། །
en: Their wishlessness is boundless.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ཚད་མེད་པའོ། །
en: Their lack of conditioned existence is boundless.

source: དེ་ལྟར་ན་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པའི་མཐའ་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་གྲོལ་བ།
en: In this way they are free of desire and liberated within the realm of phenomena, the limit of reality.

source: མ་སྐྱེས་པ། དབེན་པ། བྲལ་བ། མྱ་ངན་ལས་འདས་པ། ཚད་མེད་པ་སྟེ།
en: They are unborn, serene, free, beyond suffering, and boundless.

source: རིགས་ཀྱི་བུ་མདོར་ན་ཆོས་ཐམས་ཅད་ནི་ཚད་མེད་པའོ།
en: Son of noble family, in short, all phenomena are boundless.

source: དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པ། མ་འགགས་པ་ཞེས་བྱའོ། །
en: Therefore all phenomena are said to be unborn and unceasing.

source: གང་མི་སྐྱེ་མི་འགག་པ་དེ་ནི་ཚད་མེད་པའོ། །
en: Whatever is unborn and unceasing is boundless.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འོད་སེང་གེ་རྣམ་པར་རོལ་པའི་རྒྱལ་པོས་
en: “Padmaśrīgarbha, the Blessed One, the thus-gone, worthy, completely perfect Buddha, King of the Golden-Hued Lion’s Play,

source: དེ་ལྟར་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་དེ་ལ་ཚད་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་ཚུལ་ལ་མཁས་པ་འདི་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: taught King Glorious Splendor perfectly how to gain expertise in the mode of Dharma known as the boundless seal

source: དེས་ཀྱང་ཆོས་ཚད་མེད་པ་དག་ལ་ངེས་པར་སེམས་པར་བྱས་པར་གྱུར་ཏོ། །
en: so that he, too, could reflect on the boundless Dharma.

source: དེ་ནས་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལས་ཆོས་དཔག་ཏུ་མེད་པ་བསྟན་པ་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་སྟེ།
en: Then, as King Glorious Splendor received the teaching on the boundless Dharma from that blessed one, he was satisfied and pleased.

source: ཡི་རངས་ནས་རབ་ཏུ་དགའ་སྟེ་དགའ་བ་དང་།
en: He rejoiced and was extremely delighted.

source: ཡིད་བདེ་བ་སྐྱེས་ནས་བུ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་མངོན་པར་བསྟོད་པ།
en: Since he was so joyful and happy, together with his sons he praised that blessed one with these verses:

source: འདྲེན་པ་ཆོས་རྣམས་ཀུན་ལ་དབང་སྒྱུར་བ། །
en: “ ‘Guide, you are the master of all dharmas.

source: སྨྲ་བའི་ཚོགས་རྣམས་ཡང་དག་རབ་ཏུ་འཇོམས། །བདུད་ཀྱི་རྩོད་དང་ཉོན་མོངས་ཀུན་སེལ་བ།
en: You conquer the hordes of theoreticians; You eliminate all of the demons’ disputes and disturbing emotions.

source: མཚུངས་མེད་ཡེ་ཤེས་མཚོ་ལ་ཕྱག་འཚལ་ལོ། །
en: We prostrate to you, incomparable ocean of wisdom.

source: ཉི་ཟླ་དག་དང་མེ་ཡི་འོད་རྣམས་དང་། །
en: “ ‘The sun, the moon, and the light of fires,

source: བརྒྱ་བྱིན་ཚངས་པ་ནོར་བུ་གློག་འོད་རྣམས། །
en: The radiance of Śakra, Brahmā, jewels, and lightning,

source: བདེ་གཤེགས་གཟི་བརྗིད་ཀྱིས་ནི་མོག་མོག་གྱུར། །
en: Are eclipsed by the splendor of the Blissful One.

source: མི་མཆོག་འོད་མཛད་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: We prostrate to you, luminous leader of men.

source: ཐུབ་པ་བསྐལ་པ་རྒྱ་མཚོ་འདས་པར་ཡང་། །
en: “ ‘Sage, throughout an ocean of eons,

source: དཀའ་བ་རྣམ་པ་དུ་མ་སྤྱོད་པར་མཛད། །
en: You perform many hardships.

source: ཕྲིན་ལས་དེ་ཡི་འབྲས་བུ་ཡིད་འོང་སྟེ། །དེས་ན་འགྲོ་བས་བལྟས་ན་ངོམས་མི་འགྱུར། །སྐྱེ་དང་རྒ་དང་ན་དང་འཆིས་གཙེས་ཤིང་། །
en: Since the result of that activity is so beautiful, Beings never tire of beholding you.

source: སེམས་ཅན་སྡུག་བསྔལ་མང་པོས་གཟིར་གཟིགས་ནས། །
en: “ ‘Seeing that beings are pained by many sufferings,

source: དེ་དག་རྣམས་ལ་ཐུབ་ཆེན་ཐུགས་རྗེ་སྟེ། །རྟག་ཏུ་མི་འཕོ་ཞི་བའི་ཆོས་ཀྱང་སྟོན། །
en: And tormented by birth, old age, sickness, and death, Great sage, your compassion for them Will never change as you teach the Dharma of peace.

source: སྲིད་གསུམ་སྲོག་ཆགས་ཀུན་གྱི་སྨན་པ་འདྲ། །འདོད་ཆགས་ཞེ་སྡང་མུན་པ་ཐམས་ཅད་སྦྱོང་། །
en: “ ‘You are like a physician for all beings in the three existences; You purify all attachment, anger, and darkness.

source: ཐུགས་རྗེ་བསྐྱེད་པ་མཛད་ནས་ཆོས་ཀྱི་སྨན། །ཞི་བ་བླ་ན་མེད་པར་རབ་ཏུ་སྟོན།
en: Dharma physician, you develop compassion And teach on the unsurpassed state of peace.

source: སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་རབ་ཏུ་མཁྱེན།
en: “ ‘You know well all beings’ actions.

source: རབ་འབྱམ་ཞིང་རྣམས་ཀུན་ན་སྲོག་ཆགས་ཀྱི། །མཁྱེན་ནས་
en: Since you understand everyone in the infinite worlds,

source: གང་གིས་མྱ་ངན་འདས་མཆོག་ལ། །རེག་པར་འགྱུར་བ་དེ་འདྲའི་ཆོས་ཀྱང་སྟོན། །
en: You teach the Dharma that brings them To supreme nirvāṇa.

source: མི་མཆོག་ཁྱོད་ཀྱི་ཐུགས་རྗེ་ཅི་འདྲ་བ། །ཇི་སྙེད་རབ་འབྱམ་ཞིང་གི་ཉན་ཐོས་དང་། །རྐྱེན་བྱུང་ཐུབ་པ་མ་ལུས་དེ་དག་ལ། །དེ་འདྲ་བ་ཡི་སྙིང་རྗེ་ཡོང་མ་མཆིས།
en: “ ‘Supreme man, your compassion is such That it is a compassion unrivaled By all hearers and conditioned sages In all the infinite worlds.

source: བསོད་ནམས་ཕུང་པོ་མཚན་མཆོག་རྣམས་དང་ལྡན།
en: “ ‘A gathering of merit endowed with the supreme marks,

source: རྒྱལ་བའི་སྐུ་ནི་གསེར་གྱི་རི་བོ་འདྲ། །
en: The body of the Victor is like a golden mountain,

source: བྱེ་བའི་ཉི་ལས་ལྷག་པའི་གཟི་མངའ་བ། །
en: More splendorous than ten million suns.

source: མི་མཆོག་མཚུངས་མ་མཆིས་ལ་ཕྱག་འཚལ་ལོ། །
en: We prostrate to you, unrivaled perfect man.

source: ཆོས་སྤྲིན་རྒྱ་ལས་ཆོས་ཆར་འབེབས་པ་ན། །
en: “ ‘When from the expansive cloud of Dharma the rain of teachings falls,

source: གང་དག་རྒྱ་ཆེན་མོས་པ་སྤྱོད་ཡུལ་བ། །
en: Those who have the vast inclinations to be within its scope,

source: སྔོན་གྱི་སངས་རྒྱས་སྤྱོད་ལ་འཇིགས་མ་མཆིས། །
en: And were not intimidated by the acts of previous buddhas,

source: དེ་དག་རྟག་ཏུ་བདེ་གཤེགས་མདུན་ན་མཆིས། །
en: Always find themselves before the blissful one.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བསམ་ཡས་སུ། །
en: “ ‘During an inconceivable number of trillions of eons,

source: མི་མཆོག་མཐོང་བ་རྙེད་པར་ཤིན་ཏུ་དཀའ། །
en: It is exceedingly difficult to behold the perfect man.

source: བསོད་ནམས་ལས་ཀྱིས་བསམ་པ་ཡོངས་སྦྱངས་པ། །དེ་དག་མིག་ལམ་རྣམ་པར་འདྲེན་རྣམས་གདའ། །
en: Yet through the workings of merit the mind is purified And the guides become visible.

source: རྒྱལ་བའི་སྐུ་ནི་ཆོས་དབྱིངས་རྒྱས་པར་འགེངས། །ཞིང་རྣམས་རབ་འབྱམ་ཐམས་ཅད་ན་ཡང་གདའ། །
en: “ ‘The bodies of the Victor fill the entire realm of phenomena And are present in all infinite realms.

source: བཞུད་དང་བྱོན་པར་མངོན་པ་ཡོད་མ་མཆིས། །
en: They know no actual coming or going,

source: འོན་ཀྱང་འཇིག་རྟེན་དག་ན་སྣོད་བཞིན་གདའ། །
en: And yet fill the world like a vessel.

source: བདེན་པ་གཟིགས་ཤིང་དོན་དམ་སྟོན་པ་པོ། །
en: “ ‘You who see the truths and teach the ultimate,

source: ཆོས་ཀྱི་སྦྱིན་བདག་ཞི་བའི་ཐུགས་ལྡན་པ། །
en: You are a benefactor of the Dharma with a peaceful mind;

source: རྒལ་ནས་སྲོག་ཆགས་བཅིངས་གྱུར་གཞན་སྒྲོལ་བ། །
en: Having crossed over, you liberate others who were in bondage.

source: བདེ་བར་གཤེགས་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: We prostrate to you, Blissful One.

source: ཁྱོད་ཀྱིས་སྐྱེ་བའི་ཤིང་ལྗོན་རྩ་ནས་བཏོན། །
en: “ ‘You have pulled out the tree of rebirth by its root;

source: ང་རྒྱལ་རི་བོ་སྲ་བ་རྡུལ་དུ་བརླགས། །
en: You have reduced to rubble the massive mountain of pride;

source: རྒོད་པ་མི་མངའ་གཡོ་དང་སྒྱུ་དང་བྲལ། །
en: You know no agitation and are beyond deceit and deception.

source: རབ་ཞི་ཐུགས་དང་ལྡན་ལ་ཕྱག་འཚལ་ལོ། །
en: We prostrate to you, who are completely at peace.

source: མི་མཆོག་ཆགས་པ་ཐམས་ཅད་ཡོང་མི་མངའ། །
en: “ ‘Perfect man, you have gone beyond all attachments,

source: དགོངས་པ་ས་དང་ཆུ་དང་མེ་དང་འདྲ། །
en: And your realization is like earth, water, and fire.

source: རྒྱལ་བ་སེམས་ཅན་ཀུན་ལ་སྙོམས་ཐུགས་ལྡན། །
en: Victor, you are impartial toward all beings.

source: རླུང་དང་ནམ་མཁའ་འདྲ་ལ་ཕྱག་འཚལ་ལོ། །ཐུབ་པ་ཆེན་པོ་ཡོན་ཏན་འདི་འདྲའི་གཏེར། །
en: We prostrate to you, who are like wind and space. “ ‘Great sage, your qualities are like a treasure;

source: བསོད་ནམས་རྒྱ་མཚོ་ལས་བྱུང་སྐུ་དང་ལྡན། །
en: Your body appears from an ocean of merit.

source: བསྐལ་པ་ཁྲག་ཁྲིག་དག་ཏུ་དེ་བརྗོད་ཀྱང་། །ཡོན་ཏན་རྒྱ་མཚོ་ཟད་པར་ནུས་མ་ལགས། །
en: Even if we had billions of eons to speak of them We would be unable to exhaust the ocean of your qualities.

source: ཡོན་ཏན་རྒྱ་མཚོ་ལྷ་མིས་མཆོད་པ་ལ། །བདག་ནི་བུ་དང་བཅས་ཏེ་མཆོད་པ་བགྱིད། །
en: “ ‘Gods and men worship your ocean of qualities, And I with my sons offer worship as well.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ནས་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་དེ་དུས་གཞན་ཞིག་ན།
en: “Padmaśrīgarbha, on another occasion King Glorious Splendor was in his pleasure grove

source: རྒྱལ་བ་མཆོད་པའི་བསོད་ནམས་ཅི་མཆིས་པ། །དེས་ནི་ཐུབ་པ་ཆེན་པོ་ཁྱོད་འདྲར་ཤོག །
en: By whatever merit accrues from worshipping the Victor, May we become a great sage like you!’

source: སྐྱེད་མོས་ཚལ་ན་བསམ་གཏན་གྱི་གནས་པས་གནས་ཤིང་འདུག་པའི་བློ་གཡས་གཡོན་ནས།
en: practicing concentration,

source: ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་པད་མ་བཀྲ་བ་བལྟ་ན་སྡུག་པ་དག་པ་གཉིས་བྱུང་ངོ་། །
en: two beautiful and captivating lotus flowers made of uragasāra sandalwood sprang up on either side of him.

source: པད་མ་དེ་གཉིས་ལས་ཁྱེའུ་མིང་རིན་ཆེན་སེམས་དང་། རིན་ཆེན་མཆོག་ཅེས་བྱ་བ་གཉིས་རྫུས་ཏེ་བྱུང་ནས། །
en: From those two lotus flowers, two beings miraculously appeared: one bore the name Precious Mind, and the other was called Perfect Wealth.

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ལྟར་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་ཁྱེའུ་གཉིས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་པ་མཐོང་ངོ་། །
en: “Padmaśrīgarbha, when King Glorious Splendor arose from his absorption, he saw those two beings sitting there, cross-legged,

source: སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ། །
en: They sat cross-legged in the flowers.

source: མཐོང་ནས་ཀྱང་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: and at the sight he spoke this verse:

source: དྲིས་པ་སྨྲོས་ཤིག་གྲོགས་པོ་དག །
en: Friends, please answer this question.’

source: ཁྱེད་གཉིས་ལྷ་འམ་ཀླུ་ཡིན་ནམ། །
en: “ ‘Are the two of you gods or nāgas?

source: གནོད་སྦྱིན་དྲི་ཟ་མི་ཅི་འམ། །
en: Or yakṣas, gandharvas, or kinnaras?

source: མི་འམ་མི་མ་ཡིན་ནམ་ཅི། །
en: Or humans or nonhumans?

source: པད་མའི་དཔལ་གྱི་སྙིང་པོ་དེ་ལྟར་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་ཀྱི་གཡས་ཕྱོགས་སུ་བྱུང་བའི་ཁྱེའུ་གང་ཡིན་པ་དེས་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། །
en: “Padmaśrīgarbha, the being who had appeared on King Glorious Splendor’s right replied with these verses to King Glorious Splendor:

source: གྲོགས་པོ་ཆོས་ཀུན་སྟོང་པ་ཡི། །མིང་ནི་འདྲི་བར་བྱེད་དམ་ཅི། །
en: “ ‘My friend, all phenomena are empty, So why do you ask their names?

source: ཆོས་རྣམས་ཐམས་ཅད་མིང་མེད་ན། །གང་གི་མིང་ནི་འདྲི་བར་བྱེད། །
en: Since all phenomena are devoid of names, What name are you asking for?

source: སྟོང་ཉིད་གང་ལའང་ལྷ་མེད་ཅིང་། །ཀླུ་མེད་སྲིན་པོ་ཡོང་མ་ཡིན། །
en: “ ‘In emptiness, there are no gods, No nāgas or rākṣasas,

source: མིའམ་མི་མ་ཡིན་ཡང་རུང་། །ཐམས་ཅད་དེ་ན་ཡོང་མེད་དོ། །
en: Nor any humans or nonhumans. None of them exist within emptiness.’
